-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Host: sql311.infinityfree.com
-- Generation Time: Jun 12, 2025 at 09:19 AM
-- Server version: 10.6.19-MariaDB
-- PHP Version: 7.2.22

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `if0_39139281_infosh`
--

-- --------------------------------------------------------

--
-- Table structure for table `admins`
--

CREATE TABLE `admins` (
  `id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(255) NOT NULL,
  `full_name` varchar(100) NOT NULL,
  `email` varchar(100) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `address` text DEFAULT NULL,
  `birth_date` date DEFAULT NULL,
  `gender` enum('male','female','other') DEFAULT NULL,
  `national_id` varchar(20) DEFAULT NULL,
  `profile_image` varchar(255) DEFAULT NULL,
  `registration_date` datetime DEFAULT current_timestamp(),
  `last_login` datetime DEFAULT NULL,
  `is_active` tinyint(1) DEFAULT 1,
  `is_verified` tinyint(1) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `admins`
--

INSERT INTO `admins` (`id`, `username`, `password`, `full_name`, `email`, `phone`, `address`, `birth_date`, `gender`, `national_id`, `profile_image`, `registration_date`, `last_login`, `is_active`, `is_verified`) VALUES
(8, 'if0_39139281', '$2y$10$Pk5cFnAkJR9erchRFLZr3eSJSbn/FLvvgf5tOJRv05w9GEWkXrYae', 'Mostafam Ta3', 'mostafamtaha66@gmail.com', '+201003504114', 'الجيزة العياط', '2024-05-21', 'male', '1000000000', NULL, '2025-06-08 03:17:07', '2025-06-08 19:49:10', 1, 1),
(9, 'asmaa mohamed', '$2y$10$YmANr2yY845M.5sJe.uAe.ws0NUeNdV5tkkfrzaJe3nCK/Td6xcTy', 'Asmaa Mohamed taha', 'am010taha@gmail.com', '1068404109', 'المساندة العياط', '2025-06-08', 'female', '0000000000', NULL, '2025-06-08 16:32:32', '2025-06-08 16:34:38', 1, 1),
(10, 'زياد محمود', '$2y$10$9baCBPzQ9Sl5lGa98HxFbOKTzVIRF7rQ7Zs65tp7v.KIgfGXDM1JW', 'Ziad Mahmoud', 'zezo0115434@gmail.com', '01154342537', 'المساندة العياط', '2007-12-22', 'male', '307122221035', 'uploads/profiles/684592b0af34b.jpg', '2025-06-08 16:40:00', '2025-06-08 16:43:32', 1, 1),
(13, 'Mostafa', '$2y$10$Bn/hnFisc68RxLNxHjDmzeIfeMZckW7hgBJrTyxaSnpPrB.cPh432', 'Mostafam Ta3', 'admin@gmail.com', '1003504114', 'الجيزة العياط', '1998-06-09', 'male', '1000000000', NULL, '2025-06-09 00:06:42', '2025-06-12 16:18:47', 1, 1),
(14, 'Adel tarek', '$2y$10$xdrdtPa/6dGy63Nz8vquSuQuijkqLKoTNevHKHbw6iOmasU/VN28u', 'عادل طارق عادل', 'adiltarekzhran@gmail.com', '01122743851', 'الجيزه العياط المساندة', '1998-06-29', 'male', '000000000000', NULL, '2025-06-09 00:37:22', '2025-06-09 00:41:43', 1, 1),
(15, 'sha-exam.ct.wt', '$2y$10$.3zScQOCIz89V3mVamhzc.Uh98u9QBPI05YkPIV2ZyoLaG21DnTZS', 'Mostafam Ta3', 'adiin@gmail.com', '1111111111', 'الجيزة العياط', '2025-06-08', 'male', '1000000000', NULL, '2025-06-09 14:51:28', NULL, 1, 0);

-- --------------------------------------------------------

--
-- Table structure for table `chat_messages`
--

CREATE TABLE `chat_messages` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `message` text NOT NULL,
  `timestamp` datetime NOT NULL DEFAULT current_timestamp(),
  `file_name` varchar(255) DEFAULT NULL,
  `file_path` varchar(255) DEFAULT NULL,
  `file_type` varchar(100) DEFAULT NULL,
  `file_size` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `chat_messages`
--

INSERT INTO `chat_messages` (`id`, `user_id`, `message`, `timestamp`, `file_name`, `file_path`, `file_type`, `file_size`) VALUES
(7, 14, 'السلام عليكم ورحمة الله وبركاته', '2025-06-11 04:30:31', NULL, NULL, NULL, NULL),
(9, 10, 'لو مكان إدخال الرسائل نازل لتحت اعمل تحميل للصفحة', '2025-06-11 05:07:30', NULL, NULL, NULL, NULL),
(25, 14, 'Welcome to Group لو عندك أزي زفت حطه هنا', '2025-06-11 13:46:20', NULL, NULL, NULL, NULL),
(70, 8, 'يا شيخ', '2025-06-12 00:12:51', NULL, NULL, NULL, NULL),
(71, 15, 'السلام عليكم ورحمة الله وبركاته', '2025-06-12 00:13:00', NULL, NULL, NULL, NULL),
(72, 8, 'وعليكم السلام ورحمة الله وبركاته', '2025-06-12 00:13:21', NULL, NULL, NULL, NULL),
(73, 15, 'ايه المجتمع دا', '2025-06-12 00:13:24', NULL, NULL, NULL, NULL),
(74, 8, 'لا هو واحد بس هنا', '2025-06-12 00:13:33', NULL, NULL, NULL, NULL),
(75, 8, 'اللى هو انا', '2025-06-12 00:13:39', NULL, NULL, NULL, NULL),
(76, 15, 'بجد بتعملوا إيه هنا بقى', '2025-06-12 00:13:57', NULL, NULL, NULL, NULL),
(77, 10, 'بتلعب', '2025-06-12 00:14:23', NULL, NULL, NULL, NULL),
(78, 10, 'واحد نسكافيه', '2025-06-12 00:14:28', NULL, NULL, NULL, NULL),
(79, 10, 'تلعب ؟', '2025-06-12 00:14:39', NULL, NULL, NULL, NULL),
(80, 15, 'لسه شارب من شوية هخش انام واصحى اشوف الموقع دا', '2025-06-12 00:15:12', NULL, NULL, NULL, NULL),
(81, 10, 'تمام', '2025-06-12 00:15:23', NULL, NULL, NULL, NULL),
(83, 15, 'جدي', '2025-06-12 00:15:53', NULL, NULL, NULL, NULL),
(84, 10, 'هو لسا الموقع نسخة بيته،', '2025-06-12 00:16:21', NULL, NULL, NULL, NULL),
(86, 10, 'مش ده النسخة الاساسية اساسًا', '2025-06-12 00:16:35', NULL, NULL, NULL, NULL),
(88, 10, 'يا شيخ عادل', '2025-06-12 00:33:41', NULL, NULL, NULL, NULL),
(89, 16, 'حبيبي ياخ مصطفي', '2025-06-12 00:34:26', NULL, NULL, NULL, NULL),
(90, 16, 'ازيك وازي الاولاد', '2025-06-12 00:34:32', NULL, NULL, NULL, NULL),
(91, 10, 'الحمد لله فى نعمة', '2025-06-12 00:34:45', NULL, NULL, NULL, NULL),
(92, 16, 'يارب دايما', '2025-06-12 00:34:49', NULL, NULL, NULL, NULL),
(93, 10, 'بس انا لسا معملتش واحد نسكافية مع مراتي', '2025-06-12 00:35:00', NULL, NULL, NULL, NULL),
(94, 16, 'ايه مش ناوي تاخد الاولاد توديهم الساحل يراجل', '2025-06-12 00:35:03', NULL, NULL, NULL, NULL),
(95, 16, 'مانا مستنيك تاخد العيال الساحل عشان اغفلك ياخ', '2025-06-12 00:35:13', NULL, NULL, NULL, NULL),
(96, 10, 'معيش فلوس', '2025-06-12 00:35:17', NULL, NULL, NULL, NULL),
(97, 16, 'اه جيت علي الجرح ياخ مصطفي', '2025-06-12 00:35:27', NULL, NULL, NULL, NULL),
(98, 10, 'هضيف اسئله امتى يا جدع', '2025-06-12 00:36:05', NULL, NULL, NULL, NULL),
(99, 10, '🙂', '2025-06-12 00:36:20', NULL, NULL, NULL, NULL),
(103, 10, 'هو لسا فى بشر بتنام 😑☕', '2025-06-12 00:47:27', NULL, NULL, NULL, NULL),
(104, 16, 'يرجاله حد معاه برشام للماده الي جايه', '2025-06-12 10:05:33', NULL, NULL, NULL, NULL),
(105, 16, '(بحضر للامتحان بتاع السنه الجايه من دلوقتي)', '2025-06-12 10:05:52', NULL, NULL, NULL, NULL),
(106, 16, 'كل الليالي احزان', '2025-06-12 10:05:57', NULL, NULL, NULL, NULL),
(108, 10, 'هبعتلك النهاردة ملف إللى هضيف منه اسئلة تمام؟\n.', '2025-06-12 11:52:39', NULL, NULL, NULL, NULL),
(109, 16, 'تمام', '2025-06-12 12:57:05', NULL, NULL, NULL, NULL),
(110, 16, 'هات يسطا اي برشام هوا حد يكره', '2025-06-12 12:57:14', NULL, NULL, NULL, NULL),
(112, 4, 'شغال على ده دلوقتي', '2025-06-12 13:48:03', '20250612_134108.jpg', './uploads/chat_files/684ab0633bc43_12d7966f4859536b.jpg', 'image/jpeg', 2147819);

-- --------------------------------------------------------

--
-- Table structure for table `exam_results`
--

CREATE TABLE `exam_results` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `subject` varchar(100) NOT NULL,
  `lesson_name` varchar(255) NOT NULL,
  `question_type` enum('بنك اسئلة','اختبارات شاملة','تحدى نفسك','إمتحان الوزارة') NOT NULL,
  `score` int(11) NOT NULL,
  `total_questions` int(11) NOT NULL,
  `exam_date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `exam_results`
--

INSERT INTO `exam_results` (`id`, `user_id`, `subject`, `lesson_name`, `question_type`, `score`, `total_questions`, `exam_date`) VALUES
(86, 4, 'العلوم', 'الاول', 'إمتحان الوزارة', 0, 1, '2025-06-03 10:54:22'),
(87, 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', 'بنك اسئلة', 1, 1, '2025-06-03 16:44:58'),
(88, 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', 'بنك اسئلة', 3, 4, '2025-06-03 18:14:22'),
(89, 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', 'بنك اسئلة', 1, 3, '2025-06-03 18:27:48'),
(90, 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', 'بنك اسئلة', 3, 3, '2025-06-03 18:29:55'),
(91, 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', 'بنك اسئلة', 4, 4, '2025-06-03 23:53:18'),
(92, 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', 'بنك اسئلة', 8, 8, '2025-06-04 00:07:29'),
(93, 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', 'بنك اسئلة', 34, 34, '2025-06-04 01:09:32'),
(94, 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', 'بنك اسئلة', 13, 35, '2025-06-04 01:40:40'),
(95, 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', 'بنك اسئلة', 11, 32, '2025-06-04 01:55:07'),
(96, 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', 'بنك اسئلة', 9, 32, '2025-06-04 02:01:14'),
(97, 10, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', 'بنك اسئلة', 8, 32, '2025-06-04 05:23:03'),
(98, 10, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-04 05:26:23'),
(99, 10, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-04 05:29:28'),
(100, 10, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-04 05:50:45'),
(101, 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', 'بنك اسئلة', 1, 1, '2025-06-04 10:17:06'),
(102, 4, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-04 10:18:25'),
(103, 10, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-04 10:23:34'),
(104, 10, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-04 10:48:31'),
(105, 4, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-04 16:42:26'),
(106, 8, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-05 02:44:30'),
(107, 10, 'test', 'test', 'إمتحان الوزارة', 0, 1, '2025-06-05 06:31:24'),
(108, 10, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-05 06:31:39'),
(109, 10, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', 'بنك اسئلة', 1, 1, '2025-06-05 07:22:33'),
(111, 5, 'sex', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-07 05:58:34'),
(112, 5, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-07 05:59:17'),
(113, 5, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-07 05:59:39'),
(114, 4, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-08 03:08:48'),
(115, 10, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-08 03:55:12'),
(116, 10, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-08 04:04:47'),
(117, 10, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-08 14:09:31'),
(118, 10, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-08 19:56:32'),
(119, 10, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-08 20:20:12'),
(120, 10, 'test', 'test', 'إمتحان الوزارة', 1, 1, '2025-06-08 20:21:20'),
(121, 10, 'اللغة العربية', 'همزة القطع', 'بنك اسئلة', 1, 1, '2025-06-09 13:08:08'),
(122, 10, 'العلوم', 'الاول', 'بنك اسئلة', 5, 5, '2025-06-10 14:23:11'),
(123, 10, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', 'بنك اسئلة', 41, 44, '2025-06-10 19:13:52'),
(124, 10, 'اللغة العربية', 'همزة القطع، وألف الوصل', 'بنك اسئلة', 9, 9, '2025-06-10 21:00:39'),
(125, 10, 'الفيزياء', 'التيار الكهربى وقانون أوم', 'بنك اسئلة', 13, 14, '2025-06-10 21:47:17'),
(126, 10, 'الفيزياء', 'التيار الكهربى وقانون أوم', 'بنك اسئلة', 40, 40, '2025-06-11 02:19:06'),
(127, 10, 'الفيزياء', 'التيار الكهربى وقانون أوم', 'بنك اسئلة', 40, 40, '2025-06-11 14:41:39'),
(128, 10, 'الفيزياء', 'التيار الكهربى وقانون أوم', 'بنك اسئلة', 40, 40, '2025-06-11 14:55:41');

-- --------------------------------------------------------

--
-- Table structure for table `login_attempts`
--

CREATE TABLE `login_attempts` (
  `id` int(11) NOT NULL,
  `admin_id` int(11) DEFAULT NULL,
  `ip_address` varchar(45) NOT NULL,
  `attempt_time` datetime DEFAULT current_timestamp(),
  `is_successful` tinyint(1) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `login_attempts`
--

INSERT INTO `login_attempts` (`id`, `admin_id`, `ip_address`, `attempt_time`, `is_successful`) VALUES
(27, 8, '156.222.22.129', '2025-06-08 03:17:19', 1),
(28, 9, '102.188.62.101', '2025-06-08 16:32:53', 1),
(29, 8, '102.188.62.101', '2025-06-08 16:35:16', 1),
(30, 10, '105.207.219.163', '2025-06-08 16:40:24', 1),
(31, 10, '105.207.219.163', '2025-06-08 16:43:53', 1),
(32, 10, '105.207.219.163', '2025-06-08 17:02:45', 1),
(33, 8, '156.222.22.129', '2025-06-08 19:48:13', 1),
(34, 10, '105.206.209.108', '2025-06-08 20:48:19', 1),
(36, 13, '156.222.22.129', '2025-06-09 00:09:02', 1),
(37, 14, '154.136.137.54', '2025-06-09 00:37:45', 1),
(38, 13, '156.222.22.129', '2025-06-09 00:59:13', 1),
(39, 13, '156.222.22.129', '2025-06-09 00:59:15', 1),
(40, 13, '156.222.22.129', '2025-06-09 12:44:35', 1),
(41, 13, '156.222.22.129', '2025-06-09 14:53:20', 0),
(42, 13, '156.222.22.129', '2025-06-09 14:53:31', 1),
(43, 13, '156.222.22.129', '2025-06-09 15:31:11', 0),
(44, 13, '156.222.22.129', '2025-06-09 15:31:16', 0),
(45, 13, '156.222.22.129', '2025-06-09 15:31:29', 1),
(46, 13, '156.222.22.129', '2025-06-10 01:42:33', 1),
(47, 13, '156.222.219.66', '2025-06-10 13:24:47', 1),
(48, 13, '156.222.65.50', '2025-06-10 18:13:49', 0),
(49, 13, '156.222.65.50', '2025-06-10 18:14:11', 0),
(50, 13, '156.222.65.50', '2025-06-10 18:14:23', 0),
(51, 13, '156.222.65.50', '2025-06-10 18:15:49', 1),
(52, 13, '156.222.65.50', '2025-06-11 00:57:51', 0),
(53, 13, '156.222.65.50', '2025-06-11 00:58:01', 0),
(54, 13, '156.222.65.50', '2025-06-11 00:58:14', 1),
(55, 13, '156.222.213.51', '2025-06-11 13:25:17', 0),
(56, 13, '156.222.213.51', '2025-06-11 13:25:27', 1),
(57, 13, '156.222.213.51', '2025-06-11 14:35:58', 1),
(58, 13, '156.222.213.51', '2025-06-12 14:40:44', 1),
(59, 13, '156.222.213.51', '2025-06-12 16:17:20', 1);

-- --------------------------------------------------------

--
-- Table structure for table `questions`
--

CREATE TABLE `questions` (
  `id` int(11) NOT NULL,
  `question_text` text NOT NULL,
  `question_image` varchar(255) DEFAULT NULL,
  `option1` text NOT NULL,
  `option2` text NOT NULL,
  `option3` text NOT NULL,
  `option4` text NOT NULL,
  `correct_answer` int(1) NOT NULL COMMENT '1-4',
  `subject` varchar(100) NOT NULL,
  `lesson_name` varchar(255) NOT NULL,
  `lesson` varchar(100) DEFAULT NULL,
  `question_type` enum('بنك اسئلة','اختبارات شاملة','تحدى نفسك','إمتحان الوزارة') NOT NULL,
  `note1` text DEFAULT NULL,
  `note2` text DEFAULT NULL,
  `note3` text DEFAULT NULL,
  `note4` text DEFAULT NULL,
  `added_date` datetime NOT NULL DEFAULT current_timestamp(),
  `added_by` int(11) DEFAULT NULL COMMENT 'ID of admin who added',
  `modified_date` datetime DEFAULT NULL,
  `modified_by` int(11) DEFAULT NULL COMMENT 'ID of admin who modified',
  `difficulty_level` enum('سهل','متوسط','صعب') DEFAULT 'متوسط'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `questions`
--

INSERT INTO `questions` (`id`, `question_text`, `question_image`, `option1`, `option2`, `option3`, `option4`, `correct_answer`, `subject`, `lesson_name`, `lesson`, `question_type`, `note1`, `note2`, `note3`, `note4`, `added_date`, `added_by`, `modified_date`, `modified_by`, `difficulty_level`) VALUES
(220, '.', 'uploads/questions/question_683f9d8c22f7e.jpg', 'درجة انصهارها منخفضة', 'كثافتها مرتفعة', 'شديدة الصلابة', 'غير قابلة للتشكيل', 3, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-03 18:12:44', 4, NULL, NULL, 'متوسط'),
(223, 'فلز انتقالى مقاوم للتآكل وغير سام، لذا يرتبط بالعظام جيدًا.\r\nما اسم هذا الفلز؟', NULL, 'النيكل', 'الكوبلت', 'الكروم', 'التيتانيوم', 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-03 18:20:59', 4, NULL, NULL, 'متوسط'),
(225, 'أقوى فلزات السلسلة الانتقالية الأولى من حيث الصلابة هو', NULL, 'الحديد', 'الخارصين', 'التيتانيوم', 'النيكل', 3, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-03 18:26:56', 4, NULL, NULL, 'متوسط'),
(226, '.', 'uploads/questions/question_683fed4622718.jpg', 'يقع فى المجموعة 1B', 'يستخدم فى طلاء المعادن لحمايتها من الأخت الاختزال', 'يشبة الكربون فى مظهره', 'قابل للتمغنط', 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-03 23:52:54', 4, NULL, NULL, 'متوسط'),
(227, 'كل مما يلي يعبر عن العنصر الانتقالى (M) الذي يقع فى السلسلة الانتقالية الأولى ويقاوم فعل العوامل الجوية، عدا', NULL, 'يقع فى الدورة الرابعة من الجدول الدورى.', 'يستخدم فى دباغة الجلود.', 'أحد مركباته يستخدم فى صناعة الأصباغ.', 'يستخدم فى صناعة عبوات المشروبات الغازية', 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-03 23:57:26', 4, NULL, NULL, 'متوسط'),
(228, '.', 'uploads/questions/question_683feeee0c847.jpg', 'صناعة  الأصباغ', 'حفظ المواد الغذائية', 'صناعة المطاط', 'دباغة الجلود', 1, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-03 23:59:58', 4, NULL, NULL, 'متوسط'),
(229, '.', 'uploads/questions/question_683fef5f817e7.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:01:51', 4, NULL, NULL, 'متوسط'),
(230, '.', 'uploads/questions/question_683fefe80826c.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:04:08', 4, NULL, NULL, 'متوسط'),
(231, '.', 'uploads/questions/question_683ff1100dd5c.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:09:04', 4, NULL, NULL, 'متوسط'),
(232, '.', 'uploads/questions/question_683ff16be3d67.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:10:35', 4, NULL, NULL, 'متوسط'),
(234, '.', 'uploads/questions/question_683ff1c2ecaa3.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:12:02', 4, NULL, NULL, 'متوسط'),
(235, '.', 'uploads/questions/question_683ff204df5f5.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:13:08', 4, NULL, NULL, 'متوسط'),
(236, '.', 'uploads/questions/question_683ff2c58634b.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:16:21', 4, NULL, NULL, 'متوسط'),
(237, '.', 'uploads/questions/question_683ff3401d2f7.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:18:24', 4, NULL, NULL, 'متوسط'),
(238, '.', 'uploads/questions/question_683ff3d976eb5.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:20:57', 4, NULL, NULL, 'متوسط'),
(239, '.', 'uploads/questions/question_683ff41c7e6ca.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:22:04', 4, NULL, NULL, 'متوسط'),
(240, '.', 'uploads/questions/question_683ff46fa9af0.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:23:27', 4, NULL, NULL, 'متوسط'),
(241, '.', 'uploads/questions/question_683ff4d7c3af4.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:25:11', 4, NULL, NULL, 'متوسط'),
(242, '.', 'uploads/questions/question_683ff5153aabf.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:26:13', 4, NULL, NULL, 'متوسط'),
(243, '.', 'uploads/questions/question_683ff559b596d.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:27:21', 4, NULL, NULL, 'متوسط'),
(244, '.', 'uploads/questions/question_683ff5b322dfd.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:28:51', 4, NULL, NULL, 'متوسط'),
(245, '.', 'uploads/questions/question_683ff60b1ee31.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:30:19', 4, NULL, NULL, 'متوسط'),
(246, '.', 'uploads/questions/question_683ff65744502.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:31:35', 4, NULL, NULL, 'متوسط'),
(248, '.', 'uploads/questions/question_683ff74db75dd.jpg', 'الكروم', 'المنجنيز', 'الحديد', 'الكوبلت', 2, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:35:41', 4, NULL, NULL, 'متوسط'),
(249, '.', 'uploads/questions/question_683ff79935bb7.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:36:57', 4, NULL, NULL, 'متوسط'),
(250, '.', 'uploads/questions/question_683ff7e48d58b.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:38:12', 4, NULL, NULL, 'متوسط'),
(251, '.', 'uploads/questions/question_683ff83a69830.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:39:38', 4, NULL, NULL, 'متوسط'),
(252, '.', 'uploads/questions/question_683ff8cfbfad0.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:42:07', 4, NULL, NULL, 'متوسط'),
(253, '.', 'uploads/questions/question_683ff947ca3bd.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:44:07', 4, NULL, NULL, 'متوسط'),
(254, '.', 'uploads/questions/question_683ff9fd6dcf4.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-04 00:47:09', 4, NULL, NULL, 'متوسط'),
(261, '.', 'uploads/questions/question_6846b176d480e.jpg', 'أ', 'ب', 'ج', 'د', 4, 'اللغة العربية', 'همزة القطع، وألف الوصل', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-09 13:03:34', NULL, '2025-06-10 20:58:25', NULL, 'متوسط'),
(263, '.', 'uploads/questions/question_6846ce2da6a0a.jpg', 'أ', 'ب', 'ج', 'د', 3, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-09 15:06:05', 10, '2025-06-10 14:28:18', NULL, 'متوسط'),
(269, '.', 'uploads/questions/question_68482a5568956.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 15:51:33', 10, '2025-06-10 15:54:14', NULL, 'متوسط'),
(270, '.', 'uploads/questions/question_68482ba30066c.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 15:57:07', 10, NULL, NULL, 'متوسط'),
(273, '.', 'uploads/questions/question_68484d6d2b4e2.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 18:21:17', 10, '2025-06-10 18:24:31', NULL, 'متوسط'),
(274, 'المركبات الآتية يمكنها القيام بدور العامل المؤكسد أو العامل المختزل فى التفاعلات الكيميائية، عدا', '', 'ا', 'ب', 'ج', 'د', 3, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 18:29:44', 10, '2025-06-10 18:31:56', NULL, 'متوسط'),
(275, '.', 'uploads/questions/question_684850ff09bc2.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 18:36:31', 10, NULL, NULL, 'متوسط'),
(276, '.', 'uploads/questions/question_684851733688e.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 18:38:27', 10, NULL, NULL, 'متوسط'),
(277, '.', 'uploads/questions/question_684851daf01da.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 18:40:10', 10, NULL, NULL, 'متوسط'),
(278, '.', 'uploads/questions/question_68485225142c6.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 18:41:25', 10, NULL, NULL, 'متوسط'),
(279, 'تتفق ذرات الفلز الانتقالى المستخدم فى دباغة الجلود مع ذرات أول فلز عرفه الإنسان فى', 'uploads/questions/question_684852be157ea.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 18:43:58', 10, NULL, NULL, 'متوسط'),
(280, '.', 'uploads/questions/question_68485332f085d.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 18:45:54', 10, NULL, NULL, 'متوسط'),
(281, '.', 'uploads/questions/question_6848543324a1d.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 18:50:11', 10, NULL, NULL, 'متوسط'),
(282, '.', 'uploads/questions/question_684854af3a514.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الكيمياء', 'ما قبل الخصائص العامة لعناصر السلسة الانتقالية الأولى', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 18:52:15', 10, NULL, NULL, 'متوسط'),
(283, '#2', 'uploads/questions/question_68486f23b4e2f.jpg', 'ا', 'ب', 'ج', 'د', 4, 'اللغة العربية', 'همزة القطع، وألف الوصل', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 20:45:07', 10, NULL, NULL, 'متوسط'),
(284, '#3', 'uploads/questions/question_68486f9f8d190.jpg', 'ا', 'ب', 'ج', 'د', 3, 'اللغة العربية', 'همزة القطع، وألف الوصل', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 20:47:11', 10, NULL, NULL, 'متوسط'),
(285, '#4', 'uploads/questions/question_68486fe900eb5.jpg', 'ا', 'ب', 'ج', 'د', 4, 'اللغة العربية', 'همزة القطع، وألف الوصل', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 20:48:25', 10, NULL, NULL, 'متوسط'),
(286, '#5', 'uploads/questions/question_6848702e2247a.jpg', 'ا', 'ب', 'ج', 'د', 3, 'اللغة العربية', 'همزة القطع، وألف الوصل', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 20:49:34', 10, NULL, NULL, 'متوسط'),
(287, '#6', 'uploads/questions/question_684870a1cca42.jpg', 'ا', 'ب', 'ج', 'د', 3, 'اللغة العربية', 'همزة القطع، وألف الوصل', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 20:51:29', 10, NULL, NULL, 'متوسط'),
(288, '#7', 'uploads/questions/question_684871180341a.jpg', 'ا', 'ب', 'ج', 'د', 3, 'اللغة العربية', 'همزة القطع، وألف الوصل', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 20:53:28', 10, NULL, NULL, 'متوسط'),
(289, '#8', 'uploads/questions/question_684871615370d.jpg', 'ا', 'ب', 'ج', 'د', 2, 'اللغة العربية', 'همزة القطع، وألف الوصل', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 20:54:41', 10, NULL, NULL, 'متوسط'),
(290, '#9', 'uploads/questions/question_684871a96c2f2.jpg', 'ا', 'ب', 'ج', 'د', 3, 'اللغة العربية', 'همزة القطع، وألف الوصل', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 20:55:53', 10, NULL, NULL, 'متوسط'),
(291, '#1', 'uploads/questions/question_6848776d3b38e.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 21:20:29', 10, NULL, NULL, 'متوسط'),
(292, '#2', 'uploads/questions/question_684877e346eb1.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 21:22:27', 10, '2025-06-10 21:48:26', NULL, 'متوسط'),
(293, '#3-1', 'uploads/questions/question_68487843aa979.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 21:24:03', 10, NULL, NULL, 'متوسط'),
(294, 'إذا كانت شدة الكهربى المار فى الموصل خلال 10s هى', 'uploads/questions/question_68487922dcded.jpg', '2ms', '4ms', '6ms', '8ms', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 21:27:46', 10, NULL, NULL, 'متوسط'),
(295, '#4', 'uploads/questions/question_6848796a677db.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 21:28:58', 10, NULL, NULL, 'متوسط'),
(296, '#5', 'uploads/questions/question_684879c863286.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 21:30:32', 10, NULL, NULL, 'متوسط'),
(297, '#6', 'uploads/questions/question_68487a9b5714d.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 21:34:03', 10, NULL, NULL, 'متوسط'),
(298, '#7', 'uploads/questions/question_68487ad2e5d89.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 21:34:58', 10, NULL, NULL, 'متوسط'),
(299, '#8', 'uploads/questions/question_68487b2097f5d.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 21:36:16', 10, NULL, NULL, 'متوسط'),
(300, '#8-2', 'uploads/questions/question_68487bc1a7707.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 21:38:57', 10, NULL, NULL, 'متوسط'),
(301, '#9', 'uploads/questions/question_68487c156daba.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 21:40:21', 10, NULL, NULL, 'متوسط'),
(302, '#10', 'uploads/questions/question_68487c5412004.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 21:41:24', 10, NULL, NULL, 'متوسط'),
(303, '#11', 'uploads/questions/question_68487c92958a3.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 21:42:26', 10, NULL, NULL, 'متوسط'),
(304, '#12', 'uploads/questions/question_68487ce434ee3.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-10 21:43:48', 10, NULL, NULL, 'متوسط'),
(306, 'تعتبر البطارية فى الدائرة الكهربية هى مصدر', NULL, 'الشحنات الموجبة', 'الشحنات السالبة', 'التوصيلية الكهربية', 'الطاقة الكهربية', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:07:42', 10, NULL, NULL, 'متوسط'),
(307, '#14', 'uploads/questions/question_6848acf3cc5dd.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:08:51', 10, NULL, NULL, 'متوسط'),
(308, '#15', 'uploads/questions/question_6848ad318fc11.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:09:53', 10, NULL, NULL, 'متوسط'),
(309, '#16', 'uploads/questions/question_6848ad7fe43ec.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:11:11', 10, NULL, NULL, 'متوسط'),
(310, '#17', 'uploads/questions/question_6848adc59788d.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:12:21', 10, NULL, NULL, 'متوسط'),
(311, '#18', 'uploads/questions/question_6848ae292dfa5.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:14:01', 10, NULL, NULL, 'متوسط'),
(312, '#18-2', 'uploads/questions/question_6848aebaa5e77.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:16:26', 10, NULL, NULL, 'متوسط'),
(313, '#18-3', 'uploads/questions/question_6848af996a46c.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:20:09', 10, NULL, NULL, 'متوسط'),
(314, '#19', 'uploads/questions/question_6848afea8f67e.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:21:30', 10, NULL, NULL, 'متوسط'),
(317, '#20', 'uploads/questions/question_6848b10859b94.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:26:16', 10, NULL, NULL, 'متوسط'),
(318, '#21', 'uploads/questions/question_6848b14ccf9fb.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:27:24', 10, NULL, NULL, 'متوسط'),
(319, '#22', 'uploads/questions/question_6848b1a3472cd.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:28:51', 10, NULL, NULL, 'متوسط'),
(320, '#23', 'uploads/questions/question_6848b1fa5d566.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:30:18', 10, NULL, NULL, 'متوسط'),
(321, '#24', 'uploads/questions/question_6848b24b09c6d.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:31:39', 10, NULL, NULL, 'متوسط'),
(322, '#24-2', 'uploads/questions/question_6848b2a603d42.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:33:10', 10, NULL, NULL, 'متوسط'),
(323, '#25', 'uploads/questions/question_6848b2f3160c8.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:34:27', 10, NULL, NULL, 'متوسط'),
(324, '#26', 'uploads/questions/question_6848b32ae964d.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:35:22', 10, NULL, NULL, 'متوسط'),
(325, '#27', 'uploads/questions/question_6848b36373c47.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:36:19', 10, NULL, NULL, 'متوسط'),
(326, '#28', 'uploads/questions/question_6848b3c503410.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:37:57', 10, NULL, NULL, 'متوسط'),
(327, '#29', 'uploads/questions/question_6848b3fb03c63.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:38:51', 10, '2025-06-11 01:39:38', NULL, 'متوسط'),
(328, '#30', 'uploads/questions/question_6848b48509bba.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:41:09', 10, NULL, NULL, 'متوسط'),
(329, '#31', 'uploads/questions/question_6848b4c0e9ce9.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:42:08', 10, NULL, NULL, 'متوسط'),
(330, '#32', 'uploads/questions/question_6848b4fe8d957.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:43:10', 10, NULL, NULL, 'متوسط'),
(331, '#33', 'uploads/questions/question_6848b57b3f85f.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:45:15', 10, NULL, NULL, 'متوسط'),
(332, '#33-2', 'uploads/questions/question_6848b61bdb0e9.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:47:55', 10, '2025-06-11 01:50:09', NULL, 'متوسط'),
(333, '#33-3', 'uploads/questions/question_6848b674bafe3.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:49:24', 10, NULL, NULL, 'متوسط'),
(334, '#34', 'uploads/questions/question_6848b6f73ba26.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:51:35', 10, NULL, NULL, 'متوسط'),
(335, '#35', 'uploads/questions/question_6848b747c9256.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:52:55', 10, NULL, NULL, 'متوسط'),
(336, '#35-2', 'uploads/questions/question_6848b79674840.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:54:14', 10, NULL, NULL, 'متوسط'),
(337, '#36', 'uploads/questions/question_6848b7e4dc954.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:55:32', 10, NULL, NULL, 'متوسط'),
(338, '#37', 'uploads/questions/question_6848b83ea3ea6.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:57:02', 10, NULL, NULL, 'متوسط'),
(339, '#38', 'uploads/questions/question_6848b89450dd2.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:58:28', 10, NULL, NULL, 'متوسط'),
(340, '#39', 'uploads/questions/question_6848b8ce9ec2d.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 01:59:26', 10, NULL, NULL, 'متوسط'),
(341, '#40', 'uploads/questions/question_6848b91ab0e13.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 02:00:42', 10, NULL, NULL, 'متوسط'),
(342, '#41', 'uploads/questions/question_6848b95391c1d.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 02:01:40', 10, NULL, NULL, 'متوسط'),
(343, '#42', 'uploads/questions/question_6848b99e9e753.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 02:02:55', 10, NULL, NULL, 'متوسط'),
(344, '#43', 'uploads/questions/question_6848b9dfe056d.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 02:04:00', 10, NULL, NULL, 'متوسط'),
(345, 'إذا زاد طول سلك من النحاس إلى الضعف  ونقصت مساحة مقطعه إلى النصف، فإن مقاومته', NULL, 'تزداد للضعف', 'تقل للنصف', 'تزداد إلى أربعة أمثالها', 'تقل للربع', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 02:06:55', 10, NULL, NULL, 'متوسط'),
(347, 'عند زيادة طول موصل للضعف ونقص مساحة مقطعه للنصف فإن المقاومة النوعية لمادته', NULL, 'تزداد أربعة أمثال', 'تزداد ثلاثة أمثال', 'نقل للنصف', 'لا تتغير', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 12:31:15', 10, NULL, NULL, 'متوسط'),
(348, '#46', 'uploads/questions/question_68494d45e065a.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 12:32:53', 10, NULL, NULL, 'متوسط'),
(349, '#47', 'uploads/questions/question_68494d9e5713e.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 12:34:22', 10, NULL, NULL, 'متوسط'),
(350, '#47-2', 'uploads/questions/question_68494df7c972b.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 12:35:51', 10, NULL, NULL, 'متوسط'),
(351, '#48', 'uploads/questions/question_68494e5befba5.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 12:37:31', 10, NULL, NULL, 'متوسط'),
(352, '#49', 'uploads/questions/question_68494e96aeeef.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 12:38:30', 10, NULL, NULL, 'متوسط'),
(353, '#50', 'uploads/questions/question_68494ed4d582f.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 12:39:32', 10, NULL, NULL, 'متوسط'),
(354, '#51', 'uploads/questions/question_68494f1de2e15.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 12:40:45', 10, NULL, NULL, 'متوسط'),
(355, '#52', 'uploads/questions/question_68494f7da8dbd.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 12:42:21', 10, NULL, NULL, 'متوسط'),
(356, '#53', 'uploads/questions/question_68495001a37bf.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 12:44:33', 10, NULL, NULL, 'متوسط'),
(358, '#55', 'uploads/questions/question_6849568569b23.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:12:21', 10, NULL, NULL, 'متوسط'),
(359, '#56', 'uploads/questions/question_684956cbe12a6.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:13:31', 10, NULL, NULL, 'متوسط'),
(360, '#57', 'uploads/questions/question_684957412bef6.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:15:29', 10, NULL, NULL, 'متوسط'),
(361, '#57-2', 'uploads/questions/question_684957d520637.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:17:57', 10, NULL, NULL, 'متوسط'),
(362, '#58', 'uploads/questions/question_684958208f763.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:19:12', 10, NULL, NULL, 'متوسط'),
(363, '#62', 'uploads/questions/question_68495877857b8.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:20:39', 10, NULL, NULL, 'متوسط'),
(364, '#63', 'uploads/questions/question_684958b71da20.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:21:43', 10, NULL, NULL, 'متوسط'),
(365, '#64', 'uploads/questions/question_684959342e5e5.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:23:48', 10, NULL, NULL, 'متوسط'),
(367, '#65', 'uploads/questions/question_68495a555e1d3.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:28:37', NULL, NULL, NULL, 'متوسط'),
(368, '#66', 'uploads/questions/question_68495ae364f91.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:30:59', NULL, NULL, NULL, 'متوسط'),
(369, '#67', 'uploads/questions/question_68495b40b6e6e.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:32:32', NULL, NULL, NULL, 'متوسط'),
(370, '#68', 'uploads/questions/question_68495b8e06662.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:33:50', NULL, NULL, NULL, 'متوسط'),
(371, '#69', 'uploads/questions/question_68495c3c6954d.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:36:44', NULL, NULL, NULL, 'متوسط'),
(373, '#70', 'uploads/questions/question_68495f35c3a63.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:49:25', NULL, NULL, NULL, 'متوسط'),
(374, '#71', 'uploads/questions/question_68495f767907d.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:50:30', NULL, NULL, NULL, 'متوسط'),
(375, '#72', 'uploads/questions/question_68495fd034b1c.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:52:00', NULL, NULL, NULL, 'متوسط'),
(376, '#73', 'uploads/questions/question_68496013b6152.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:53:07', NULL, NULL, NULL, 'متوسط'),
(377, '#74', 'uploads/questions/question_684960770700d.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:54:47', NULL, NULL, NULL, 'متوسط'),
(378, '#75', 'uploads/questions/question_684960d646e0d.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:56:22', NULL, NULL, NULL, 'متوسط'),
(379, '#76', 'uploads/questions/question_684961360d96d.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:57:58', NULL, NULL, NULL, 'متوسط'),
(380, '#76-2', 'uploads/questions/question_684961956ef26.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 13:59:33', NULL, NULL, NULL, 'متوسط'),
(382, '#77', 'uploads/questions/question_6849628e4b4a0.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 14:03:42', NULL, NULL, NULL, 'متوسط'),
(383, '#78', NULL, 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 14:05:20', NULL, NULL, NULL, 'متوسط'),
(384, '#79', NULL, 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 14:06:33', NULL, NULL, NULL, 'متوسط'),
(385, '#79-2', 'uploads/questions/question_684963a29adc9.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 14:08:18', NULL, NULL, NULL, 'متوسط'),
(386, '#80', 'uploads/questions/question_684963e4c6a69.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 14:09:24', NULL, NULL, NULL, 'متوسط'),
(387, '#81', 'uploads/questions/question_6849643e0f9dc.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 14:10:54', NULL, NULL, NULL, 'متوسط'),
(388, '#81-2', 'uploads/questions/question_68496489d717d.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 14:12:09', NULL, NULL, NULL, 'متوسط'),
(389, '#81-3', 'uploads/questions/question_6849650823cba.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 14:14:16', NULL, NULL, NULL, 'متوسط'),
(390, '#82', 'uploads/questions/question_6849653c303c0.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 14:15:08', NULL, NULL, NULL, 'متوسط'),
(391, '#83', 'uploads/questions/question_68496578ac482.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 14:16:08', NULL, NULL, NULL, 'متوسط'),
(392, '#83-2', 'uploads/questions/question_684965d610334.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الفيزياء', 'التيار الكهربى وقانون أوم', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-11 14:17:42', NULL, NULL, NULL, 'متوسط'),
(393, '#1', 'uploads/questions/question_684ac2790bd03.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:05:12', 4, NULL, NULL, 'متوسط'),
(395, '#2', 'uploads/questions/question_684ac2d1bf2ac.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:06:41', 4, NULL, NULL, 'متوسط'),
(396, '#3', 'uploads/questions/question_684ac33718329.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:08:22', 4, NULL, NULL, 'متوسط'),
(397, '#4', 'uploads/questions/question_684ac398a2fda.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:10:00', 4, NULL, NULL, 'متوسط'),
(398, '#5', 'uploads/questions/question_684ac3f92d754.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:11:37', 4, NULL, NULL, 'متوسط'),
(399, '#6', 'uploads/questions/question_684ac459cce40.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:13:13', 4, NULL, NULL, 'متوسط'),
(400, '#7', 'uploads/questions/question_684ac4987e1b0.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:14:16', 4, NULL, NULL, 'متوسط'),
(401, '#8', 'uploads/questions/question_684ac4e8af9b2.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:15:36', 4, NULL, NULL, 'متوسط'),
(402, '#9', 'uploads/questions/question_684ac520719da.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:16:32', 4, NULL, NULL, 'متوسط'),
(403, '#10', 'uploads/questions/question_684ac56257460.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:17:38', 4, NULL, NULL, 'متوسط'),
(404, '#11', 'uploads/questions/question_684ac5c5becb2.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:19:17', 4, '2025-06-12 15:19:46', NULL, 'متوسط'),
(405, '#12', 'uploads/questions/question_684ac62a1f5eb.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:20:58', 4, NULL, NULL, 'متوسط'),
(406, '#13', 'uploads/questions/question_684ac67f73b74.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:22:23', 4, NULL, NULL, 'متوسط'),
(407, '#14', 'uploads/questions/question_684ac6f51a32d.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:24:21', 4, NULL, NULL, 'متوسط'),
(408, '#15', 'uploads/questions/question_684ac731d409b.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:25:21', 4, NULL, NULL, 'متوسط'),
(409, '#16', 'uploads/questions/question_684ac783416b1.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:26:43', 4, NULL, NULL, 'متوسط'),
(410, '#17', 'uploads/questions/question_684ac7f310847.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:28:35', 4, NULL, NULL, 'متوسط'),
(411, '#18', 'uploads/questions/question_684ac82c0ab1a.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:29:32', 4, NULL, NULL, 'متوسط'),
(412, '#19', 'uploads/questions/question_684ac86017ddc.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:30:24', 4, NULL, NULL, 'متوسط'),
(413, '#20', 'uploads/questions/question_684ac89e3200b.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:31:26', 4, NULL, NULL, 'متوسط'),
(414, '#21', 'uploads/questions//Screenshot_20250612_161435_Adobe Acrobat.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:32:29', 4, '2025-06-12 16:19:26', NULL, 'متوسط'),
(415, '#22', 'uploads/questions/question_684ac964530af.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:34:44', 4, NULL, NULL, 'متوسط'),
(416, '#23', 'uploads/questions/question_684ac995ec123.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:35:33', 4, NULL, NULL, 'متوسط'),
(417, '#24', 'uploads/questions/question_684aca005309a.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:37:20', 4, NULL, NULL, 'متوسط'),
(418, '#25', 'uploads/questions/question_684aca5a756a4.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:38:50', 4, NULL, NULL, 'متوسط'),
(419, '#26', 'uploads/questions/question_684aca9da15bd.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:39:57', 4, NULL, NULL, 'متوسط'),
(420, '#27', 'uploads/questions/question_684acad603907.jpg', 'ا', 'ب', 'ج', 'د', 4, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:40:54', 4, NULL, NULL, 'متوسط'),
(421, '#28', 'uploads/questions/question_684acb210793c.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:42:09', 4, NULL, NULL, 'متوسط'),
(422, '#29', 'uploads/questions/question_684acb56cc76a.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:43:02', 4, NULL, NULL, 'متوسط'),
(423, '#30', 'uploads/questions/question_684acb8c1d4cd.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:43:56', 4, NULL, NULL, 'متوسط'),
(424, '#31', 'uploads/questions/question_684acbccdcc10.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:45:00', 4, NULL, NULL, 'متوسط'),
(427, '#32', 'uploads/questions/question_684acc68391f9.jpg', 'ا', 'ب', 'ج', 'د', 1, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:47:36', 4, NULL, NULL, 'متوسط'),
(428, '#33', 'uploads/questions/question_684accaadfab4.jpg', 'ا', 'ب', 'ج', 'د', 2, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:48:42', 4, NULL, NULL, 'متوسط'),
(429, '#34', 'uploads/questions/question_684accf34e6ee.jpg', 'ا', 'ب', 'ج', 'د', 3, 'الرياضيات', 'اشتقاق الدوال المثلثية', NULL, 'بنك اسئلة', '', '', '', '', '2025-06-12 15:49:55', 4, NULL, NULL, 'متوسط');

-- --------------------------------------------------------

--
-- Table structure for table `student_answers`
--

CREATE TABLE `student_answers` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `exam_result_id` int(11) NOT NULL,
  `question_id` int(11) NOT NULL,
  `user_answer` int(1) NOT NULL,
  `is_correct` tinyint(1) NOT NULL,
  `answer_date` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `student_answers`
--

INSERT INTO `student_answers` (`id`, `user_id`, `exam_result_id`, `question_id`, `user_answer`, `is_correct`, `answer_date`) VALUES
(160, 4, 59, 217, 1, 1, '2025-06-02 02:22:40'),
(161, 4, 60, 217, 1, 1, '2025-06-02 02:28:16'),
(162, 4, 61, 218, 4, 1, '2025-06-02 02:35:02'),
(163, 5, 62, 218, 4, 1, '2025-06-02 02:46:43'),
(164, 4, 63, 218, 3, 0, '2025-06-02 03:04:06'),
(165, 4, 64, 217, 1, 1, '2025-06-02 03:17:44'),
(166, 4, 65, 218, 4, 1, '2025-06-02 12:36:00'),
(167, 4, 66, 218, 4, 1, '2025-06-02 13:58:39'),
(168, 4, 67, 218, 1, 0, '2025-06-02 14:08:57'),
(169, 4, 68, 218, 4, 1, '2025-06-02 14:11:16'),
(170, 4, 69, 218, 2, 0, '2025-06-02 14:11:41'),
(171, 4, 70, 217, 4, 0, '2025-06-02 14:19:32'),
(172, 4, 71, 218, 4, 1, '2025-06-02 14:22:35'),
(173, 4, 72, 218, 4, 1, '2025-06-02 14:23:40'),
(174, 4, 73, 218, 4, 1, '2025-06-02 14:30:16'),
(175, 4, 74, 218, 4, 1, '2025-06-02 14:31:28'),
(176, 4, 75, 218, 4, 1, '2025-06-02 23:28:30'),
(177, 4, 76, 218, 4, 1, '2025-06-02 23:29:40'),
(178, 8, 77, 218, 4, 1, '2025-06-03 03:57:28'),
(179, 8, 78, 217, 4, 0, '2025-06-03 04:02:20'),
(180, 4, 79, 218, 4, 1, '2025-06-03 05:16:52'),
(181, 4, 80, 218, 4, 1, '2025-06-03 05:17:57'),
(182, 4, 81, 217, 3, 0, '2025-06-03 05:20:57'),
(183, 4, 82, 217, 1, 1, '2025-06-03 05:45:46'),
(184, 4, 83, 218, 4, 1, '2025-06-03 07:07:03'),
(185, 4, 84, 218, 4, 1, '2025-06-03 07:11:55'),
(186, 4, 85, 218, 4, 1, '2025-06-03 10:51:14'),
(187, 4, 86, 217, 4, 0, '2025-06-03 10:54:22'),
(188, 4, 87, 219, 1, 1, '2025-06-03 16:44:58'),
(189, 4, 88, 222, 3, 1, '2025-06-03 18:14:22'),
(190, 4, 88, 220, 3, 1, '2025-06-03 18:14:22'),
(191, 4, 88, 219, 3, 0, '2025-06-03 18:14:22'),
(192, 4, 88, 221, 1, 1, '2025-06-03 18:14:22'),
(193, 4, 89, 220, 3, 1, '2025-06-03 18:27:48'),
(194, 4, 89, 225, 2, 0, '2025-06-03 18:27:48'),
(195, 4, 89, 223, 3, 0, '2025-06-03 18:27:48'),
(196, 4, 90, 223, 4, 1, '2025-06-03 18:29:55'),
(197, 4, 90, 220, 3, 1, '2025-06-03 18:29:55'),
(198, 4, 90, 225, 3, 1, '2025-06-03 18:29:55'),
(199, 4, 91, 223, 4, 1, '2025-06-03 23:53:18'),
(200, 4, 91, 226, 4, 1, '2025-06-03 23:53:18'),
(201, 4, 91, 225, 3, 1, '2025-06-03 23:53:18'),
(202, 4, 91, 220, 3, 1, '2025-06-03 23:53:18'),
(203, 4, 92, 227, 4, 1, '2025-06-04 00:07:29'),
(204, 4, 92, 225, 3, 1, '2025-06-04 00:07:29'),
(205, 4, 92, 229, 4, 1, '2025-06-04 00:07:29'),
(206, 4, 92, 223, 4, 1, '2025-06-04 00:07:29'),
(207, 4, 92, 230, 2, 1, '2025-06-04 00:07:29'),
(208, 4, 92, 226, 4, 1, '2025-06-04 00:07:29'),
(209, 4, 92, 228, 1, 1, '2025-06-04 00:07:29'),
(210, 4, 92, 220, 3, 1, '2025-06-04 00:07:29'),
(211, 4, 93, 254, 1, 1, '2025-06-04 01:09:32'),
(212, 4, 93, 229, 4, 1, '2025-06-04 01:09:32'),
(213, 4, 93, 226, 4, 1, '2025-06-04 01:09:32'),
(214, 4, 93, 235, 1, 1, '2025-06-04 01:09:32'),
(215, 4, 93, 236, 2, 1, '2025-06-04 01:09:32'),
(216, 4, 93, 249, 4, 1, '2025-06-04 01:09:32'),
(217, 4, 93, 227, 4, 1, '2025-06-04 01:09:32'),
(218, 4, 93, 256, 4, 1, '2025-06-04 01:09:32'),
(219, 4, 93, 241, 3, 1, '2025-06-04 01:09:32'),
(220, 4, 93, 230, 2, 1, '2025-06-04 01:09:32'),
(221, 4, 93, 248, 2, 1, '2025-06-04 01:09:32'),
(222, 4, 93, 225, 3, 1, '2025-06-04 01:09:32'),
(223, 4, 93, 239, 4, 1, '2025-06-04 01:09:32'),
(224, 4, 93, 243, 2, 1, '2025-06-04 01:09:32'),
(225, 4, 93, 246, 1, 1, '2025-06-04 01:09:32'),
(226, 4, 93, 232, 2, 1, '2025-06-04 01:09:32'),
(227, 4, 93, 237, 3, 1, '2025-06-04 01:09:32'),
(228, 4, 93, 242, 3, 1, '2025-06-04 01:09:32'),
(229, 4, 93, 231, 4, 1, '2025-06-04 01:09:32'),
(230, 4, 93, 234, 3, 1, '2025-06-04 01:09:32'),
(231, 4, 93, 247, 3, 1, '2025-06-04 01:09:32'),
(232, 4, 93, 223, 4, 1, '2025-06-04 01:09:32'),
(233, 4, 93, 244, 1, 1, '2025-06-04 01:09:32'),
(234, 4, 93, 255, 4, 1, '2025-06-04 01:09:32'),
(235, 4, 93, 252, 4, 1, '2025-06-04 01:09:32'),
(236, 4, 93, 240, 4, 1, '2025-06-04 01:09:32'),
(237, 4, 93, 238, 4, 1, '2025-06-04 01:09:32'),
(238, 4, 93, 233, 2, 1, '2025-06-04 01:09:32'),
(239, 4, 93, 253, 4, 1, '2025-06-04 01:09:32'),
(240, 4, 93, 245, 2, 1, '2025-06-04 01:09:32'),
(241, 4, 93, 251, 2, 1, '2025-06-04 01:09:32'),
(242, 4, 93, 220, 3, 1, '2025-06-04 01:09:32'),
(243, 4, 93, 250, 3, 1, '2025-06-04 01:09:32'),
(244, 4, 93, 228, 1, 1, '2025-06-04 01:09:32'),
(245, 4, 94, 251, 4, 0, '2025-06-04 01:40:40'),
(246, 4, 94, 223, 4, 1, '2025-06-04 01:40:40'),
(247, 4, 94, 226, 4, 1, '2025-06-04 01:40:40'),
(248, 4, 94, 253, 4, 1, '2025-06-04 01:40:40'),
(249, 4, 94, 230, 3, 0, '2025-06-04 01:40:40'),
(250, 4, 94, 243, 4, 0, '2025-06-04 01:40:40'),
(251, 4, 94, 236, 4, 0, '2025-06-04 01:40:40'),
(252, 4, 94, 233, 1, 0, '2025-06-04 01:40:40'),
(253, 4, 94, 254, 3, 0, '2025-06-04 01:40:40'),
(254, 4, 94, 256, 2, 0, '2025-06-04 01:40:40'),
(255, 4, 94, 232, 3, 0, '2025-06-04 01:40:40'),
(256, 4, 94, 252, 4, 1, '2025-06-04 01:40:40'),
(257, 4, 94, 220, 1, 0, '2025-06-04 01:40:40'),
(258, 4, 94, 245, 4, 0, '2025-06-04 01:40:40'),
(259, 4, 94, 241, 3, 1, '2025-06-04 01:40:40'),
(260, 4, 94, 228, 2, 0, '2025-06-04 01:40:40'),
(261, 4, 94, 239, 3, 0, '2025-06-04 01:40:40'),
(262, 4, 94, 231, 3, 0, '2025-06-04 01:40:40'),
(263, 4, 94, 244, 4, 0, '2025-06-04 01:40:40'),
(264, 4, 94, 240, 4, 1, '2025-06-04 01:40:40'),
(265, 4, 94, 246, 4, 0, '2025-06-04 01:40:40'),
(266, 4, 94, 237, 4, 0, '2025-06-04 01:40:40'),
(267, 4, 94, 238, 1, 0, '2025-06-04 01:40:40'),
(268, 4, 94, 247, 3, 1, '2025-06-04 01:40:40'),
(269, 4, 94, 242, 3, 1, '2025-06-04 01:40:40'),
(270, 4, 94, 229, 1, 0, '2025-06-04 01:40:40'),
(271, 4, 94, 235, 4, 0, '2025-06-04 01:40:40'),
(272, 4, 94, 255, 4, 1, '2025-06-04 01:40:40'),
(273, 4, 94, 248, 4, 0, '2025-06-04 01:40:40'),
(274, 4, 94, 225, 4, 0, '2025-06-04 01:40:40'),
(275, 4, 94, 234, 3, 1, '2025-06-04 01:40:40'),
(276, 4, 94, 249, 4, 1, '2025-06-04 01:40:40'),
(277, 4, 94, 250, 4, 0, '2025-06-04 01:40:40'),
(278, 4, 94, 227, 4, 1, '2025-06-04 01:40:40'),
(279, 4, 94, 257, 4, 1, '2025-06-04 01:40:40'),
(280, 4, 95, 248, 2, 1, '2025-06-04 01:55:07'),
(281, 4, 95, 244, 3, 0, '2025-06-04 01:55:07'),
(282, 4, 95, 249, 2, 0, '2025-06-04 01:55:07'),
(283, 4, 95, 239, 3, 0, '2025-06-04 01:55:07'),
(284, 4, 95, 230, 4, 0, '2025-06-04 01:55:07'),
(285, 4, 95, 242, 3, 1, '2025-06-04 01:55:07'),
(286, 4, 95, 236, 3, 0, '2025-06-04 01:55:07'),
(287, 4, 95, 232, 3, 0, '2025-06-04 01:55:07'),
(288, 4, 95, 245, 3, 0, '2025-06-04 01:55:07'),
(289, 4, 95, 227, 3, 0, '2025-06-04 01:55:07'),
(290, 4, 95, 250, 3, 1, '2025-06-04 01:55:07'),
(291, 4, 95, 253, 3, 0, '2025-06-04 01:55:07'),
(292, 4, 95, 234, 3, 1, '2025-06-04 01:55:07'),
(293, 4, 95, 233, 4, 0, '2025-06-04 01:55:07'),
(294, 4, 95, 240, 4, 1, '2025-06-04 01:55:07'),
(295, 4, 95, 228, 4, 0, '2025-06-04 01:55:07'),
(296, 4, 95, 231, 4, 1, '2025-06-04 01:55:07'),
(297, 4, 95, 226, 4, 1, '2025-06-04 01:55:07'),
(298, 4, 95, 235, 4, 0, '2025-06-04 01:55:07'),
(299, 4, 95, 241, 4, 0, '2025-06-04 01:55:07'),
(300, 4, 95, 243, 4, 0, '2025-06-04 01:55:07'),
(301, 4, 95, 229, 4, 1, '2025-06-04 01:55:07'),
(302, 4, 95, 238, 4, 1, '2025-06-04 01:55:07'),
(303, 4, 95, 247, 4, 0, '2025-06-04 01:55:07'),
(304, 4, 95, 252, 4, 1, '2025-06-04 01:55:07'),
(305, 4, 95, 254, 4, 0, '2025-06-04 01:55:07'),
(306, 4, 95, 225, 4, 0, '2025-06-04 01:55:07'),
(307, 4, 95, 220, 4, 0, '2025-06-04 01:55:07'),
(308, 4, 95, 237, 4, 0, '2025-06-04 01:55:07'),
(309, 4, 95, 223, 4, 1, '2025-06-04 01:55:07'),
(310, 4, 95, 246, 3, 0, '2025-06-04 01:55:07'),
(311, 4, 95, 251, 3, 0, '2025-06-04 01:55:07'),
(312, 4, 96, 246, 3, 0, '2025-06-04 02:01:14'),
(313, 4, 96, 238, 4, 1, '2025-06-04 02:01:14'),
(314, 4, 96, 234, 4, 0, '2025-06-04 02:01:14'),
(315, 4, 96, 248, 3, 0, '2025-06-04 02:01:14'),
(316, 4, 96, 231, 2, 0, '2025-06-04 02:01:14'),
(317, 4, 96, 228, 3, 0, '2025-06-04 02:01:14'),
(318, 4, 96, 233, 3, 0, '2025-06-04 02:01:14'),
(319, 4, 96, 229, 3, 0, '2025-06-04 02:01:14'),
(320, 4, 96, 237, 2, 0, '2025-06-04 02:01:14'),
(321, 4, 96, 251, 3, 0, '2025-06-04 02:01:14'),
(322, 4, 96, 223, 3, 0, '2025-06-04 02:01:14'),
(323, 4, 96, 247, 3, 1, '2025-06-04 02:01:14'),
(324, 4, 96, 230, 3, 0, '2025-06-04 02:01:14'),
(325, 4, 96, 252, 4, 1, '2025-06-04 02:01:14'),
(326, 4, 96, 241, 3, 1, '2025-06-04 02:01:14'),
(327, 4, 96, 254, 3, 0, '2025-06-04 02:01:14'),
(328, 4, 96, 242, 3, 1, '2025-06-04 02:01:14'),
(329, 4, 96, 227, 4, 1, '2025-06-04 02:01:14'),
(330, 4, 96, 232, 4, 0, '2025-06-04 02:01:14'),
(331, 4, 96, 220, 4, 0, '2025-06-04 02:01:14'),
(332, 4, 96, 249, 4, 1, '2025-06-04 02:01:14'),
(333, 4, 96, 250, 4, 0, '2025-06-04 02:01:14'),
(334, 4, 96, 244, 4, 0, '2025-06-04 02:01:14'),
(335, 4, 96, 239, 2, 0, '2025-06-04 02:01:14'),
(336, 4, 96, 236, 3, 0, '2025-06-04 02:01:14'),
(337, 4, 96, 225, 4, 0, '2025-06-04 02:01:14'),
(338, 4, 96, 226, 3, 0, '2025-06-04 02:01:14'),
(339, 4, 96, 240, 4, 1, '2025-06-04 02:01:14'),
(340, 4, 96, 253, 4, 1, '2025-06-04 02:01:14'),
(341, 4, 96, 235, 4, 0, '2025-06-04 02:01:14'),
(342, 4, 96, 245, 4, 0, '2025-06-04 02:01:14'),
(343, 4, 96, 243, 4, 0, '2025-06-04 02:01:14'),
(344, 10, 97, 242, 2, 0, '2025-06-04 05:23:03'),
(345, 10, 97, 250, 4, 0, '2025-06-04 05:23:03'),
(346, 10, 97, 235, 4, 0, '2025-06-04 05:23:03'),
(347, 10, 97, 228, 4, 0, '2025-06-04 05:23:03'),
(348, 10, 97, 246, 4, 0, '2025-06-04 05:23:03'),
(349, 10, 97, 237, 4, 0, '2025-06-04 05:23:03'),
(350, 10, 97, 240, 4, 1, '2025-06-04 05:23:03'),
(351, 10, 97, 233, 4, 0, '2025-06-04 05:23:03'),
(352, 10, 97, 248, 4, 0, '2025-06-04 05:23:03'),
(353, 10, 97, 245, 4, 0, '2025-06-04 05:23:03'),
(354, 10, 97, 243, 3, 0, '2025-06-04 05:23:03'),
(355, 10, 97, 249, 4, 1, '2025-06-04 05:23:03'),
(356, 10, 97, 254, 3, 0, '2025-06-04 05:23:03'),
(357, 10, 97, 225, 3, 1, '2025-06-04 05:23:03'),
(358, 10, 97, 253, 3, 0, '2025-06-04 05:23:03'),
(359, 10, 97, 238, 4, 1, '2025-06-04 05:23:03'),
(360, 10, 97, 227, 3, 0, '2025-06-04 05:23:03'),
(361, 10, 97, 223, 4, 1, '2025-06-04 05:23:03'),
(362, 10, 97, 226, 3, 0, '2025-06-04 05:23:03'),
(363, 10, 97, 241, 4, 0, '2025-06-04 05:23:03'),
(364, 10, 97, 232, 4, 0, '2025-06-04 05:23:03'),
(365, 10, 97, 229, 3, 0, '2025-06-04 05:23:03'),
(366, 10, 97, 252, 4, 1, '2025-06-04 05:23:03'),
(367, 10, 97, 247, 4, 0, '2025-06-04 05:23:03'),
(368, 10, 97, 234, 3, 1, '2025-06-04 05:23:03'),
(369, 10, 97, 220, 4, 0, '2025-06-04 05:23:03'),
(370, 10, 97, 236, 3, 0, '2025-06-04 05:23:03'),
(371, 10, 97, 231, 4, 1, '2025-06-04 05:23:03'),
(372, 10, 97, 244, 4, 0, '2025-06-04 05:23:03'),
(373, 10, 97, 230, 3, 0, '2025-06-04 05:23:03'),
(374, 10, 97, 251, 3, 0, '2025-06-04 05:23:03'),
(375, 10, 97, 239, 2, 0, '2025-06-04 05:23:03'),
(376, 10, 98, 258, 1, 1, '2025-06-04 05:26:23'),
(377, 10, 99, 258, 1, 1, '2025-06-04 05:29:28'),
(378, 10, 100, 258, 1, 1, '2025-06-04 05:50:45'),
(379, 4, 101, 258, 1, 1, '2025-06-04 10:17:06'),
(380, 4, 102, 258, 1, 1, '2025-06-04 10:18:25'),
(381, 10, 103, 258, 1, 1, '2025-06-04 10:23:34'),
(382, 10, 104, 258, 1, 1, '2025-06-04 10:48:31'),
(383, 4, 105, 258, 1, 1, '2025-06-04 16:42:26'),
(384, 8, 106, 258, 1, 1, '2025-06-05 02:44:30'),
(385, 10, 107, 258, 2, 0, '2025-06-05 06:31:24'),
(386, 10, 108, 258, 1, 1, '2025-06-05 06:31:39'),
(387, 10, 109, 258, 1, 1, '2025-06-05 07:22:33'),
(388, 10, 110, 258, 1, 1, '2025-06-07 05:43:05'),
(389, 5, 111, 258, 1, 1, '2025-06-07 05:58:34'),
(390, 5, 112, 258, 1, 1, '2025-06-07 05:59:17'),
(391, 5, 113, 258, 1, 1, '2025-06-07 05:59:39'),
(392, 4, 114, 258, 1, 1, '2025-06-08 03:08:48'),
(393, 10, 115, 258, 1, 1, '2025-06-08 03:55:12'),
(394, 10, 116, 258, 1, 1, '2025-06-08 04:04:47'),
(395, 10, 117, 258, 1, 1, '2025-06-08 14:09:31'),
(396, 10, 118, 258, 1, 1, '2025-06-08 19:56:32'),
(397, 10, 119, 258, 1, 1, '2025-06-08 20:20:12'),
(398, 10, 120, 258, 1, 1, '2025-06-08 20:21:20'),
(399, 10, 121, 261, 4, 1, '2025-06-09 13:08:08'),
(400, 10, 122, 268, 1, 1, '2025-06-10 14:23:11'),
(401, 10, 122, 264, 1, 1, '2025-06-10 14:23:11'),
(402, 10, 122, 265, 1, 1, '2025-06-10 14:23:11'),
(403, 10, 122, 267, 1, 1, '2025-06-10 14:23:11'),
(404, 10, 122, 266, 1, 1, '2025-06-10 14:23:11'),
(405, 10, 123, 234, 3, 1, '2025-06-10 19:13:52'),
(406, 10, 123, 270, 2, 0, '2025-06-10 19:13:52'),
(407, 10, 123, 230, 2, 1, '2025-06-10 19:13:52'),
(408, 10, 123, 227, 4, 1, '2025-06-10 19:13:52'),
(409, 10, 123, 232, 2, 1, '2025-06-10 19:13:52'),
(410, 10, 123, 251, 2, 1, '2025-06-10 19:13:52'),
(411, 10, 123, 280, 3, 1, '2025-06-10 19:13:52'),
(412, 10, 123, 277, 4, 0, '2025-06-10 19:13:52'),
(413, 10, 123, 245, 2, 1, '2025-06-10 19:13:52'),
(414, 10, 123, 254, 1, 1, '2025-06-10 19:13:52'),
(415, 10, 123, 243, 2, 1, '2025-06-10 19:13:52'),
(416, 10, 123, 226, 4, 1, '2025-06-10 19:13:52'),
(417, 10, 123, 228, 1, 1, '2025-06-10 19:13:52'),
(418, 10, 123, 220, 3, 1, '2025-06-10 19:13:52'),
(419, 10, 123, 223, 4, 1, '2025-06-10 19:13:52'),
(420, 10, 123, 240, 3, 0, '2025-06-10 19:13:52'),
(421, 10, 123, 274, 3, 1, '2025-06-10 19:13:52'),
(422, 10, 123, 241, 3, 1, '2025-06-10 19:13:52'),
(423, 10, 123, 231, 4, 1, '2025-06-10 19:13:52'),
(424, 10, 123, 281, 3, 1, '2025-06-10 19:13:52'),
(425, 10, 123, 238, 4, 1, '2025-06-10 19:13:52'),
(426, 10, 123, 249, 4, 1, '2025-06-10 19:13:52'),
(427, 10, 123, 233, 2, 1, '2025-06-10 19:13:52'),
(428, 10, 123, 273, 4, 1, '2025-06-10 19:13:52'),
(429, 10, 123, 253, 4, 1, '2025-06-10 19:13:52'),
(430, 10, 123, 236, 2, 1, '2025-06-10 19:13:52'),
(431, 10, 123, 239, 4, 1, '2025-06-10 19:13:52'),
(432, 10, 123, 269, 2, 1, '2025-06-10 19:13:52'),
(433, 10, 123, 275, 3, 1, '2025-06-10 19:13:52'),
(434, 10, 123, 237, 3, 1, '2025-06-10 19:13:52'),
(435, 10, 123, 229, 4, 1, '2025-06-10 19:13:52'),
(436, 10, 123, 263, 3, 1, '2025-06-10 19:13:52'),
(437, 10, 123, 278, 4, 1, '2025-06-10 19:13:52'),
(438, 10, 123, 246, 1, 1, '2025-06-10 19:13:52'),
(439, 10, 123, 250, 3, 1, '2025-06-10 19:13:52'),
(440, 10, 123, 235, 1, 1, '2025-06-10 19:13:52'),
(441, 10, 123, 282, 3, 1, '2025-06-10 19:13:52'),
(442, 10, 123, 276, 4, 1, '2025-06-10 19:13:52'),
(443, 10, 123, 252, 4, 1, '2025-06-10 19:13:52'),
(444, 10, 123, 244, 1, 1, '2025-06-10 19:13:52'),
(445, 10, 123, 279, 2, 1, '2025-06-10 19:13:52'),
(446, 10, 123, 225, 3, 1, '2025-06-10 19:13:52'),
(447, 10, 123, 242, 3, 1, '2025-06-10 19:13:52'),
(448, 10, 123, 248, 2, 1, '2025-06-10 19:13:52'),
(449, 10, 124, 288, 3, 1, '2025-06-10 21:00:39'),
(450, 10, 124, 285, 4, 1, '2025-06-10 21:00:39'),
(451, 10, 124, 287, 3, 1, '2025-06-10 21:00:39'),
(452, 10, 124, 284, 3, 1, '2025-06-10 21:00:39'),
(453, 10, 124, 261, 4, 1, '2025-06-10 21:00:39'),
(454, 10, 124, 286, 3, 1, '2025-06-10 21:00:39'),
(455, 10, 124, 289, 2, 1, '2025-06-10 21:00:39'),
(456, 10, 124, 290, 3, 1, '2025-06-10 21:00:39'),
(457, 10, 124, 283, 4, 1, '2025-06-10 21:00:39'),
(458, 10, 125, 304, 4, 1, '2025-06-10 21:47:17'),
(459, 10, 125, 303, 1, 1, '2025-06-10 21:47:17'),
(460, 10, 125, 297, 2, 1, '2025-06-10 21:47:17'),
(461, 10, 125, 299, 2, 1, '2025-06-10 21:47:17'),
(462, 10, 125, 291, 3, 1, '2025-06-10 21:47:17'),
(463, 10, 125, 301, 2, 1, '2025-06-10 21:47:17'),
(464, 10, 125, 302, 1, 1, '2025-06-10 21:47:17'),
(465, 10, 125, 296, 3, 1, '2025-06-10 21:47:17'),
(466, 10, 125, 293, 4, 1, '2025-06-10 21:47:17'),
(467, 10, 125, 295, 4, 1, '2025-06-10 21:47:17'),
(468, 10, 125, 300, 4, 1, '2025-06-10 21:47:17'),
(469, 10, 125, 292, 3, 0, '2025-06-10 21:47:17'),
(470, 10, 125, 298, 4, 1, '2025-06-10 21:47:17'),
(471, 10, 125, 294, 1, 1, '2025-06-10 21:47:17'),
(472, 10, 126, 344, 1, 1, '2025-06-11 02:19:06'),
(473, 10, 126, 312, 2, 1, '2025-06-11 02:19:06'),
(474, 10, 126, 311, 4, 1, '2025-06-11 02:19:06'),
(475, 10, 126, 293, 4, 1, '2025-06-11 02:19:06'),
(476, 10, 126, 332, 4, 1, '2025-06-11 02:19:06'),
(477, 10, 126, 310, 2, 1, '2025-06-11 02:19:06'),
(478, 10, 126, 335, 2, 1, '2025-06-11 02:19:06'),
(479, 10, 126, 333, 4, 1, '2025-06-11 02:19:06'),
(480, 10, 126, 309, 4, 1, '2025-06-11 02:19:06'),
(481, 10, 126, 300, 4, 1, '2025-06-11 02:19:06'),
(482, 10, 126, 339, 4, 1, '2025-06-11 02:19:06'),
(483, 10, 126, 299, 2, 1, '2025-06-11 02:19:06'),
(484, 10, 126, 341, 2, 1, '2025-06-11 02:19:06'),
(485, 10, 126, 307, 4, 1, '2025-06-11 02:19:06'),
(486, 10, 126, 317, 2, 1, '2025-06-11 02:19:06'),
(487, 10, 126, 324, 3, 1, '2025-06-11 02:19:06'),
(488, 10, 126, 301, 2, 1, '2025-06-11 02:19:06'),
(489, 10, 126, 328, 4, 1, '2025-06-11 02:19:06'),
(490, 10, 126, 318, 1, 1, '2025-06-11 02:19:06'),
(491, 10, 126, 334, 4, 1, '2025-06-11 02:19:06'),
(492, 10, 126, 325, 3, 1, '2025-06-11 02:19:06'),
(493, 10, 126, 338, 3, 1, '2025-06-11 02:19:06'),
(494, 10, 126, 321, 2, 1, '2025-06-11 02:19:06'),
(495, 10, 126, 331, 1, 1, '2025-06-11 02:19:06'),
(496, 10, 126, 306, 4, 1, '2025-06-11 02:19:06'),
(497, 10, 126, 314, 4, 1, '2025-06-11 02:19:06'),
(498, 10, 126, 308, 1, 1, '2025-06-11 02:19:06'),
(499, 10, 126, 315, 4, 1, '2025-06-11 02:19:06'),
(500, 10, 126, 316, 4, 1, '2025-06-11 02:19:06'),
(501, 10, 126, 336, 3, 1, '2025-06-11 02:19:06'),
(502, 10, 126, 295, 4, 1, '2025-06-11 02:19:06'),
(503, 10, 126, 342, 1, 1, '2025-06-11 02:19:06'),
(504, 10, 126, 304, 4, 1, '2025-06-11 02:19:06'),
(505, 10, 126, 345, 3, 1, '2025-06-11 02:19:06'),
(506, 10, 126, 329, 4, 1, '2025-06-11 02:19:06'),
(507, 10, 126, 330, 4, 1, '2025-06-11 02:19:06'),
(508, 10, 126, 320, 4, 1, '2025-06-11 02:19:06'),
(509, 10, 126, 319, 3, 1, '2025-06-11 02:19:06'),
(510, 10, 126, 340, 2, 1, '2025-06-11 02:19:06'),
(511, 10, 126, 291, 3, 1, '2025-06-11 02:19:06'),
(512, 10, 127, 384, 2, 1, '2025-06-11 14:41:39'),
(513, 10, 127, 317, 2, 1, '2025-06-11 14:41:39'),
(514, 10, 127, 303, 1, 1, '2025-06-11 14:41:39'),
(515, 10, 127, 327, 4, 1, '2025-06-11 14:41:39'),
(516, 10, 127, 336, 3, 1, '2025-06-11 14:41:39'),
(517, 10, 127, 309, 4, 1, '2025-06-11 14:41:39'),
(518, 10, 127, 310, 2, 1, '2025-06-11 14:41:39'),
(519, 10, 127, 375, 4, 1, '2025-06-11 14:41:39'),
(520, 10, 127, 334, 4, 1, '2025-06-11 14:41:39'),
(521, 10, 127, 367, 3, 1, '2025-06-11 14:41:39'),
(522, 10, 127, 360, 1, 1, '2025-06-11 14:41:39'),
(523, 10, 127, 391, 3, 1, '2025-06-11 14:41:39'),
(524, 10, 127, 291, 3, 1, '2025-06-11 14:41:39'),
(525, 10, 127, 386, 2, 1, '2025-06-11 14:41:39'),
(526, 10, 127, 311, 4, 1, '2025-06-11 14:41:39'),
(527, 10, 127, 297, 2, 1, '2025-06-11 14:41:39'),
(528, 10, 127, 387, 1, 1, '2025-06-11 14:41:39'),
(529, 10, 127, 380, 3, 1, '2025-06-11 14:41:39'),
(530, 10, 127, 332, 4, 1, '2025-06-11 14:41:39'),
(531, 10, 127, 349, 1, 1, '2025-06-11 14:41:39'),
(532, 10, 127, 331, 1, 1, '2025-06-11 14:41:39'),
(533, 10, 127, 379, 2, 1, '2025-06-11 14:41:39'),
(534, 10, 127, 313, 3, 1, '2025-06-11 14:41:39'),
(535, 10, 127, 323, 1, 1, '2025-06-11 14:41:39'),
(536, 10, 127, 390, 4, 1, '2025-06-11 14:41:39'),
(537, 10, 127, 382, 1, 1, '2025-06-11 14:41:39'),
(538, 10, 127, 325, 3, 1, '2025-06-11 14:41:39'),
(539, 10, 127, 342, 1, 1, '2025-06-11 14:41:39'),
(540, 10, 127, 378, 2, 1, '2025-06-11 14:41:39'),
(541, 10, 127, 363, 3, 1, '2025-06-11 14:41:39'),
(542, 10, 127, 304, 4, 1, '2025-06-11 14:41:39'),
(543, 10, 127, 333, 4, 1, '2025-06-11 14:41:39'),
(544, 10, 127, 345, 3, 1, '2025-06-11 14:41:39'),
(545, 10, 127, 321, 2, 1, '2025-06-11 14:41:39'),
(546, 10, 127, 307, 4, 1, '2025-06-11 14:41:39'),
(547, 10, 127, 348, 1, 1, '2025-06-11 14:41:39'),
(548, 10, 127, 377, 3, 1, '2025-06-11 14:41:39'),
(549, 10, 127, 308, 1, 1, '2025-06-11 14:41:39'),
(550, 10, 127, 388, 3, 1, '2025-06-11 14:41:39'),
(551, 10, 127, 361, 4, 1, '2025-06-11 14:41:39'),
(552, 10, 128, 373, 1, 1, '2025-06-11 14:55:41'),
(553, 10, 128, 349, 1, 1, '2025-06-11 14:55:41'),
(554, 10, 128, 385, 1, 1, '2025-06-11 14:55:41'),
(555, 10, 128, 339, 4, 1, '2025-06-11 14:55:41'),
(556, 10, 128, 360, 1, 1, '2025-06-11 14:55:41'),
(557, 10, 128, 293, 4, 1, '2025-06-11 14:55:41'),
(558, 10, 128, 295, 4, 1, '2025-06-11 14:55:41'),
(559, 10, 128, 319, 3, 1, '2025-06-11 14:55:41'),
(560, 10, 128, 298, 4, 1, '2025-06-11 14:55:41'),
(561, 10, 128, 334, 4, 1, '2025-06-11 14:55:41'),
(562, 10, 128, 335, 2, 1, '2025-06-11 14:55:41'),
(563, 10, 128, 299, 2, 1, '2025-06-11 14:55:41'),
(564, 10, 128, 296, 3, 1, '2025-06-11 14:55:41'),
(565, 10, 128, 343, 2, 1, '2025-06-11 14:55:41'),
(566, 10, 128, 369, 3, 1, '2025-06-11 14:55:41'),
(567, 10, 128, 333, 4, 1, '2025-06-11 14:55:41'),
(568, 10, 128, 386, 2, 1, '2025-06-11 14:55:41'),
(569, 10, 128, 371, 2, 1, '2025-06-11 14:55:41'),
(570, 10, 128, 353, 2, 1, '2025-06-11 14:55:41'),
(571, 10, 128, 352, 4, 1, '2025-06-11 14:55:41'),
(572, 10, 128, 389, 3, 1, '2025-06-11 14:55:41'),
(573, 10, 128, 344, 1, 1, '2025-06-11 14:55:41'),
(574, 10, 128, 342, 1, 1, '2025-06-11 14:55:41'),
(575, 10, 128, 302, 1, 1, '2025-06-11 14:55:41'),
(576, 10, 128, 323, 1, 1, '2025-06-11 14:55:41'),
(577, 10, 128, 306, 4, 1, '2025-06-11 14:55:41'),
(578, 10, 128, 380, 3, 1, '2025-06-11 14:55:41'),
(579, 10, 128, 374, 2, 1, '2025-06-11 14:55:41'),
(580, 10, 128, 337, 3, 1, '2025-06-11 14:55:41'),
(581, 10, 128, 318, 1, 1, '2025-06-11 14:55:41'),
(582, 10, 128, 384, 2, 1, '2025-06-11 14:55:41'),
(583, 10, 128, 341, 2, 1, '2025-06-11 14:55:41'),
(584, 10, 128, 350, 3, 1, '2025-06-11 14:55:41'),
(585, 10, 128, 370, 3, 1, '2025-06-11 14:55:41'),
(586, 10, 128, 355, 2, 1, '2025-06-11 14:55:41'),
(587, 10, 128, 336, 3, 1, '2025-06-11 14:55:41'),
(588, 10, 128, 291, 3, 1, '2025-06-11 14:55:41'),
(589, 10, 128, 300, 4, 1, '2025-06-11 14:55:41'),
(590, 10, 128, 354, 3, 1, '2025-06-11 14:55:41'),
(591, 10, 128, 361, 4, 1, '2025-06-11 14:55:41');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(50) DEFAULT NULL,
  `email` varchar(100) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `password` varchar(255) DEFAULT NULL,
  `registration_date` datetime NOT NULL DEFAULT current_timestamp(),
  `last_login` datetime NOT NULL,
  `student_class` varchar(50) NOT NULL,
  `avatar` varchar(255) DEFAULT NULL,
  `share_token` varchar(32) DEFAULT NULL,
  `share_token_expiry` datetime DEFAULT NULL,
  `show_rank` tinyint(1) NOT NULL DEFAULT 1,
  `show_scores` tinyint(1) NOT NULL DEFAULT 1,
  `show_tests` tinyint(1) NOT NULL DEFAULT 1,
  `show_class` tinyint(1) NOT NULL DEFAULT 1,
  `show_avatar` tinyint(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `email`, `phone`, `password`, `registration_date`, `last_login`, `student_class`, `avatar`, `share_token`, `share_token_expiry`, `show_rank`, `show_scores`, `show_tests`, `show_class`, `show_avatar`) VALUES
(4, 'if0_39139281', 'mostafamta347@gmail.com', '+201003504114', '$2y$10$CYTLTi8Pj0cNKiN7Vr.Gt.zyfg/kw78tPrf2xfsRhive43dcdBj5.', '2025-06-02 02:16:51', '2025-06-12 13:35:38', 'الصف الثالث الثانوي', 'uploads/avatars/user_4_1749057440.jpg', 'dfebaf3618af2346fadcf6e0e322eae5', '2025-07-07 17:47:09', 1, 1, 1, 1, 1),
(5, 'Moaaz', 'moaazrandom@gmail.com', '+201061900383', '$2y$10$Q44ajF3RaDwyJHva5ytz3OAn8q8UoYwXxuLdmOcTFlS8KDpMCVqce', '2025-06-02 02:45:56', '2025-06-07 10:40:02', 'الصف الثالث الثانوي', 'uploads/avatars/user_5_1749301083.jpg', NULL, NULL, 1, 1, 1, 1, 1),
(6, 'sha-exam.ct.wt', 'mostafamtaha66@gmail.com', '+201003504116', '$2y$10$z6FfkA63wzn3m15IzQGsLuS04TxRZ1dm6Zeh8YbvI5tjh.0nsWyLi', '2025-06-02 03:03:38', '2025-06-08 20:23:03', 'الصف الثالث الثانوي', NULL, 'b22e1acde59c5dd89cf534f0b5e22297', '2025-07-08 20:23:23', 1, 1, 1, 1, 1),
(7, 'if0_39139281ddd', 'jdjdj@gmail.com', '+203591883917', '$2y$10$OoqA3G8Qg.zjppndfUWPx.qw15SLB2wZ7myRcsEYzfCxXzTmPpVjS', '2025-06-02 04:10:31', '2025-06-02 04:12:55', 'الصف الثالث الثانوي', NULL, NULL, NULL, 1, 1, 1, 1, 1),
(8, '00000', 'mostafamtaha66@gmail.com', '+203586087153', '$2y$10$SAW0zoRf0t.Zmbz6Mlly6um5bIOxmVQG9oU4mhZrAcDumEXizKh5a', '2025-06-03 03:57:05', '2025-06-11 23:15:52', 'الصف الثالث الثانوي', 'uploads/avatars/user_8_1749116617.jpg', NULL, NULL, 1, 1, 1, 1, 1),
(9, 'nady_74', 'nadymahmoudnady0@gmail.com', '+201095083064', '$2y$10$wGAH7S6Cc.PLjPVd9V.qBe3k5r7ijVoSbOcskbNAWOrQASd9rrk3u', '2025-06-04 04:21:52', '2025-06-04 04:21:59', 'الصف الثالث الثانوي', NULL, NULL, NULL, 1, 1, 1, 1, 1),
(10, 'mostafa', 'hk303792mmmm@gmail.com', '+201003504145', '$2y$10$6CvQuGhK6j7pV9K7njN/.uvLsOlLZMqZL12JyZdvC193gqNIvOJgC', '2025-06-04 05:20:20', '2025-06-12 13:25:23', 'الصف الثالث الثانوي', 'uploads/avatars/user_10_1749605542.jpg', NULL, NULL, 1, 1, 1, 1, 1),
(11, 'Kerols_Hany', 'test@gmail.com', '+201111111112', '$2y$10$4xCPaP7nIGr/98VXGpBvPuozK7a39X5rk6t0WPRZa3Hzi1ieoBjlK', '2025-06-05 04:27:02', '0000-00-00 00:00:00', 'الصف الثالث الثانوي', NULL, NULL, NULL, 1, 1, 1, 1, 1),
(14, 'Sahatalllm', 'sahatalllm@gmail.com', '+201148138347', '$2y$10$QULmWe0a53TlZvuoXEre6O7Eiufalu6snJXfvxXmk0gTEuYH5kr0u', '2025-06-11 04:06:25', '2025-06-11 04:06:38', 'الصف الثالث الثانوي', 'uploads/avatars/user_14_1749605703.jpg', NULL, NULL, 1, 1, 1, 1, 1),
(15, 'محمود بن مجدي', 'mahmoudmagdyasd9@gmail.com', '+201064618224', '$2y$10$xHiwEQanGhvwriPKUnwrX.uWqu0X6HKv90H6utvbNrlrBCqp0dKYe', '2025-06-12 00:11:08', '2025-06-12 00:11:22', 'الصف الثالث الثانوي', NULL, NULL, NULL, 1, 1, 1, 1, 1),
(16, 'Adel tarek', 'adiltarekzhran@gmail.com', '+201122743851', '$2y$10$z.oRk5R/7jB1sIKGMCc3UuZP8iBMdaKRzyxOO.277oGM3PboLoIje', '2025-06-12 00:33:17', '2025-06-12 00:33:22', 'الصف الثالث الثانوي', NULL, NULL, NULL, 1, 1, 1, 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `verification_codes`
--

CREATE TABLE `verification_codes` (
  `id` int(11) NOT NULL,
  `admin_id` int(11) NOT NULL,
  `code` varchar(16) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `expires_at` datetime NOT NULL,
  `is_used` tinyint(1) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `verification_codes`
--

INSERT INTO `verification_codes` (`id`, `admin_id`, `code`, `phone`, `created_at`, `expires_at`, `is_used`) VALUES
(31, 8, '397c4341b3ab055b', '+201003504114', '2025-06-08 03:17:07', '2025-06-08 04:17:07', 0),
(32, 8, 'c9a5449a9d73b5c4', '+201003504114', '2025-06-08 03:17:19', '2025-06-08 04:17:19', 1),
(33, 9, 'b17bb5edcf99581b', '1068404109', '2025-06-08 16:32:32', '2025-06-08 17:32:32', 1),
(34, 9, 'https://sha-exam', '1068404109', '2025-06-08 16:32:53', '2025-06-08 17:32:53', 0),
(35, 8, 'd774f6ef7244a690', '+201003504114', '2025-06-08 16:35:16', '2025-06-08 17:35:16', 1),
(36, 10, 'd592ec560ce3338f', '01154342537', '2025-06-08 16:40:00', '2025-06-08 17:40:00', 0),
(37, 10, '5b7250d95302d504', '01154342537', '2025-06-08 16:40:24', '2025-06-08 17:40:24', 1),
(38, 10, '038c2f872648c5c1', '01154342537', '2025-06-08 16:43:53', '2025-06-08 17:43:53', 0),
(39, 10, '7af66e260e84aa2c', '01154342537', '2025-06-08 17:02:45', '2025-06-08 18:02:45', 0),
(40, 8, '544e7bb69cd014b5', '+201003504114', '2025-06-08 19:48:13', '2025-06-08 20:48:13', 1),
(41, 10, '9814c07725bc88a1', '01154342537', '2025-06-08 20:48:19', '2025-06-08 21:48:19', 0),
(45, 13, 'f7b7d3154a9eab32', '1003504114', '2025-06-09 00:06:42', '2025-06-09 01:06:42', 1),
(46, 13, 'c332f077c0ed02a7', '1003504114', '2025-06-09 00:09:02', '2025-06-09 01:09:02', 0),
(47, 14, '9c9482ba5a7ce2b0', '01122743851', '2025-06-09 00:37:22', '2025-06-09 01:37:22', 0),
(48, 14, '5af83df2b165c17b', '01122743851', '2025-06-09 00:37:45', '2025-06-09 01:37:45', 1),
(49, 13, 'fe974c326c4ea18c', '1003504114', '2025-06-09 00:59:13', '2025-06-09 01:59:13', 0),
(50, 13, 'bc294c0f684ba2d5', '1003504114', '2025-06-09 12:39:15', '2025-06-09 01:59:15', 0),
(51, 13, '3ab43b1bea7ad96c', '1003504114', '2025-06-09 12:44:35', '2025-06-09 13:44:35', 1),
(52, 15, 'e978e1b7501406b4', '1111111111', '2025-06-09 14:51:28', '2025-06-09 15:51:28', 0),
(53, 13, '7f4dd593d5201ef6', '1003504114', '2025-06-09 14:53:31', '2025-06-09 15:53:31', 1),
(54, 13, '3740f4d5f6e40989', '1003504114', '2025-06-09 15:31:29', '2025-06-09 16:31:29', 0),
(55, 13, '2ff7759cb8fd16a0', '1003504114', '2025-06-10 01:42:33', '2025-06-10 02:42:33', 1),
(56, 13, '093f1d5a9e312bca', '1003504114', '2025-06-10 13:24:47', '2025-06-10 14:24:47', 1),
(57, 13, '248b5bff54f76118', '1003504114', '2025-06-10 18:15:49', '2025-06-10 19:15:49', 1),
(58, 13, '699eaed552f2db79', '1003504114', '2025-06-11 00:58:14', '2025-06-11 01:58:14', 0),
(59, 13, 'f9c45d1c01f926e5', '1003504114', '2025-06-11 13:25:27', '2025-06-11 14:25:27', 1),
(60, 13, 'b4cb0336dd86e810', '1003504114', '2025-06-11 14:35:58', '2025-06-11 15:35:58', 1),
(61, 13, '156c2383a85af988', '1003504114', '2025-06-12 14:40:44', '2025-06-12 15:40:44', 1),
(62, 13, '418686c39a099844', '1003504114', '2025-06-12 16:17:20', '2025-06-12 17:17:20', 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`),
  ADD UNIQUE KEY `phone` (`phone`);

--
-- Indexes for table `chat_messages`
--
ALTER TABLE `chat_messages`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `exam_results`
--
ALTER TABLE `exam_results`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `login_attempts`
--
ALTER TABLE `login_attempts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `admin_id` (`admin_id`);

--
-- Indexes for table `questions`
--
ALTER TABLE `questions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `added_by` (`added_by`);

--
-- Indexes for table `student_answers`
--
ALTER TABLE `student_answers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `exam_result_id` (`exam_result_id`),
  ADD KEY `question_id` (`question_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD KEY `share_token` (`share_token`);

--
-- Indexes for table `verification_codes`
--
ALTER TABLE `verification_codes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `admin_id` (`admin_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `admins`
--
ALTER TABLE `admins`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT for table `chat_messages`
--
ALTER TABLE `chat_messages`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=113;

--
-- AUTO_INCREMENT for table `exam_results`
--
ALTER TABLE `exam_results`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=129;

--
-- AUTO_INCREMENT for table `login_attempts`
--
ALTER TABLE `login_attempts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=60;

--
-- AUTO_INCREMENT for table `questions`
--
ALTER TABLE `questions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=430;

--
-- AUTO_INCREMENT for table `student_answers`
--
ALTER TABLE `student_answers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=592;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `verification_codes`
--
ALTER TABLE `verification_codes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=63;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `chat_messages`
--
ALTER TABLE `chat_messages`
  ADD CONSTRAINT `chat_messages_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `login_attempts`
--
ALTER TABLE `login_attempts`
  ADD CONSTRAINT `login_attempts_ibfk_1` FOREIGN KEY (`admin_id`) REFERENCES `admins` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `questions`
--
ALTER TABLE `questions`
  ADD CONSTRAINT `questions_ibfk_1` FOREIGN KEY (`added_by`) REFERENCES `users` (`id`) ON DELETE SET NULL;

--
-- Constraints for table `verification_codes`
--
ALTER TABLE `verification_codes`
  ADD CONSTRAINT `verification_codes_ibfk_1` FOREIGN KEY (`admin_id`) REFERENCES `admins` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
